# Ejemplo practico para pandas con Dataframes

## 1.inspeccion inical del dataframe

In [1]:
#importacion de librerias
import pandas as pd

In [2]:
#creacion de un dataframe partiendo de un diccionario
data = {

    'Nombre': ['Ana', 'Luis', 'Carlos', 'lusia ','marta','jorge','sofia ']
    , 'Edad': [23, 35, 45, 25, 30, 28, 32]
    , 'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Sevilla', 'Bilbao', 'Zaragoza', 'Malaga']
    , 'Salario': [12000, 15000, 18000, 12500, 14000, 13000, 15500]
    ,'Departamento': ['Ventas', 'Marketing', 'Ventas ', 'TI', 'TI', 'Marketing', 'ventas']
}

In [3]:
df = pd.DataFrame(data)

df

   Nombre  Edad     Ciudad  Salario Departamento
0     Ana    23     Madrid    12000       Ventas
1    Luis    35  Barcelona    15000    Marketing
2  Carlos    45   Valencia    18000      Ventas
3  lusia     25    Sevilla    12500           TI
4   marta    30     Bilbao    14000           TI
5   jorge    28   Zaragoza    13000    Marketing
6  sofia     32     Malaga    15500       ventas

# 2.estructura y resumen del Dataframe

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nombre        7 non-null      object
 1   Edad          7 non-null      int64
 2   Ciudad        7 non-null      object
 3   Salario       7 non-null      int64
 4   Departamento  7 non-null      object
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

In [5]:
df.describe()

            Edad       Salario
count   7.000000      7.000000
mean   31.142857  14285.714286
std     7.335498   2078.804602
min    23.000000  12000.000000
25%    26.500000  12750.000000
50%    30.000000  14000.000000
75%    33.500000  15250.000000
max    45.000000  18000.000000

In [6]:
df.shape

(7, 5)

In [7]:
len(df)

7

In [10]:
df.shape[0]  # Número de filas

7

In [11]:
df.shape[1]  # Número de columnas

5

In [12]:
df.dtypes # Tipo de datos de cada columna

Nombre          object
Edad             int64
Ciudad          object
Salario          int64
Departamento    object
dtype: object

In [13]:
df.columns # Nombres de las columnas

Index(['Nombre', 'Edad', 'Ciudad', 'Salario', 'Departamento'], dtype='object')

In [14]:
df.index # Índice del DataFrame

RangeIndex(start=0, stop=7, step=1)

## 3. selecion de columnas y filas

In [16]:
#seleciona una columna 
df['Edad']

0    23
1    35
2    45
3    25
4    30
5    28
6    32
Name: Edad, dtype: int64

In [17]:
#seleciona una columna 
type(df['Edad'])

pandas.core.series.Series

In [18]:
df[['Edad']]  # Selecciona varias columnas

   Edad
0    23
1    35
2    45
3    25
4    30
5    28
6    32

In [24]:
df[['Nombre','Salario'] ] # Selecciona varias columnas (no válido, corregir)

   Nombre  Salario
0     Ana    12000
1    Luis    15000
2  Carlos    18000
3  lusia     12500
4   marta    14000
5   jorge    13000
6  sofia     15500

In [25]:
df[['Nombre','Salario','Departamento'] ] # Selecciona varias columnas (no válido, corregir)

   Nombre  Salario Departamento
0     Ana    12000       Ventas
1    Luis    15000    Marketing
2  Carlos    18000      Ventas
3  lusia     12500           TI
4   marta    14000           TI
5   jorge    13000    Marketing
6  sofia     15500       ventas


# filtar todo la ciudad

In [26]:
  # Selecciona varias columnas
df[['Ciudad']] == 'Madrid' # Filtra por ciudad

   Ciudad
0    True
1   False
2   False
3   False
4   False
5   False
6   False

In [27]:
df[df['Ciudad'] == 'Madrid']  # Filtra por ciudad (no válido, corregir)

  Nombre  Edad  Ciudad  Salario Departamento
0    Ana    23  Madrid    12000       Ventas

In [34]:
df[df['Ciudad'] == 'Madrid'] [['Nombre','Ciudad','Salario']] # Filtra por ciudad (no válido, corregir)

  Nombre  Ciudad  Salario
0    Ana  Madrid    12000

In [48]:
df_Madrid= df[df['Madrid'] == 'Madrid']

KeyError: 'Madrid'

In [ ]:
df_Madrid[['Nombre','ciudad,'Salario']]

NameError: name 'df_Madrid' is not defined

In [38]:
#mostrar todos los nombres de la ciudad de mexico y del departamento de ti

df[(df ['Ciudad'] == 'Sevilla') & (df['Departamento'] == 'TI')]

   Nombre  Edad   Ciudad  Salario Departamento
3  lusia     25  Sevilla    12500           TI

## ordenar filas

In [42]:
#ordena por salario de forma acendente 
df.sort_values(by='Salario', ascending=True)

   Nombre  Edad     Ciudad  Salario Departamento
0     Ana    23     Madrid    12000       Ventas
3  lusia     25    Sevilla    12500           TI
5   jorge    28   Zaragoza    13000    Marketing
4   marta    30     Bilbao    14000           TI
1    Luis    35  Barcelona    15000    Marketing
6  sofia     32     Malaga    15500       ventas
2  Carlos    45   Valencia    18000      Ventas

In [43]:
#ordena por salario de forma decendente 
df.sort_values(by='Salario', ascending=False)

   Nombre  Edad     Ciudad  Salario Departamento
2  Carlos    45   Valencia    18000      Ventas
6  sofia     32     Malaga    15500       ventas
1    Luis    35  Barcelona    15000    Marketing
4   marta    30     Bilbao    14000           TI
5   jorge    28   Zaragoza    13000    Marketing
3  lusia     25    Sevilla    12500           TI
0     Ana    23     Madrid    12000       Ventas

In [47]:
#ORDENAR POR EL SALARIO Y LA CIUDAD 

df.sort_values(by=['Ciudad', 'Salario'])

   Nombre  Edad     Ciudad  Salario Departamento
1    Luis    35  Barcelona    15000    Marketing
4   marta    30     Bilbao    14000           TI
0     Ana    23     Madrid    12000       Ventas
6  sofia     32     Malaga    15500       ventas
3  lusia     25    Sevilla    12500           TI
2  Carlos    45   Valencia    18000      Ventas
5   jorge    28   Zaragoza    13000    Marketing

In [49]:
df.sort_values(by=['Ciudad', 'Salario'],  ascending=[True,False])

   Nombre  Edad     Ciudad  Salario Departamento
1    Luis    35  Barcelona    15000    Marketing
4   marta    30     Bilbao    14000           TI
0     Ana    23     Madrid    12000       Ventas
6  sofia     32     Malaga    15500       ventas
3  lusia     25    Sevilla    12500           TI
2  Carlos    45   Valencia    18000      Ventas
5   jorge    28   Zaragoza    13000    Marketing

## 6.crear nuevas columnas

In [51]:

df[(df ['Ciudad'] == 'Sevilla') & (df['Departamento'] == 'TI')].sort_values(['Edad','Departamento'],ascending=[True,False])

   Nombre  Edad   Ciudad  Salario Departamento
3  lusia     25  Sevilla    12500           TI